// Напишите программу, которая на вход
//принимает число и выдаёт его квадрат (число
//умноженное на само себя)

//int number;
//number = 5;
//number = number * number;
//Console.Write("Квадрат равен ");
//Console.WriteLine(number);

//Красивый способ

int number, numberSquare;
number = -11;
numberSquare = number * number;
Console.Write("Квадрат  ");
Console.WriteLine(number);
Console.Write(" равен  ");
Console.WriteLine(numberSquare);

//способ записи в одну строку

Console.WriteLine($"Квадрат {number} равен {numberSquare}");