// Найти последнее число из трехзначного числа
// Первый способ
//int num = 456;
//Console.WriteLine(num%10);

//Второй способ
Console.WriteLine("Введите число: ");
int number = int.Parse(Console.ReadLine());
Console.WriteLine(number%10);
